cask_args appdir: '/Applications'

# Add taps
tap 'caskroom/cask'
tap 'pivotal/tap'

# Python
# (see https://github.com/pyenv/pyenv/wiki/Common-build-problems#prerequisites)
brew 'pipenv'
brew 'pyenv'
brew 'readline'
brew 'xz'

# Javascript
brew 'node'
brew 'yarn'

# Java
cask 'java'
brew 'maven'
brew 'springboot'

# CLI Utilities
brew 'coreutils'
brew 'curl'
brew 'heroku/brew/heroku'
brew 'htop'
brew 'httpie'
brew 'iperf3'
brew 'mtr'
brew 'tree'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'

# Softwares
cask 'clamxav'
cask 'dash'
cask 'dropbox'
cask 'figma'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'hex-fiend'
cask 'iterm2-beta'
cask 'jetbrains-toolbox'
cask 'little-snitch'
cask 'macpass'
cask 'mactex'
cask 'mendeley'
cask 'notion'
cask 'slack'
cask 'sourcetree'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'telegram-desktop'
cask 'vlc'
cask 'whatsapp'
cask 'zotero'